In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
con = create_engine('postgresql://postgres:qwerty@localhost:5432/postgres')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [3]:
link = 'https://raw.githubusercontent.com/eric-bunch/boston_housing/master/boston.csv'

In [4]:
data = pd.read_csv(link)
data.rename(columns = {'MDEV':'MEDV'}, inplace=True)

In [5]:
data.to_sql('table_name', con, index=False, if_exists="replace")
#data.to_sql("boston", con, index=False, if_exists="replace")

In [6]:
pd.read_sql(
    """
    SELECT * FROM postgres.public.table_name
    limit 5
    """,
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

1. Выведите количество пустых значений по каждой из колонок (название колонки, кол-во пустых значений)

**1 способ**

In [7]:
pd.read_sql(
    """
    SELECT
        SUM(CASE WHEN "CRIM" IS NULL THEN 1 ELSE 0 END) AS CRIM,
        SUM(CASE WHEN "ZN" IS NULL THEN 1 ELSE 0 END) AS ZN,
        SUM(CASE WHEN "INDUS" IS NULL THEN 1 ELSE 0 END) AS INDUS,
        SUM(CASE WHEN "CHAS" IS NULL THEN 1 ELSE 0 END) AS CHAS,
        SUM(CASE WHEN "NOX" IS NULL THEN 1 ELSE 0 END) AS NOX,
        SUM(CASE WHEN "RM" IS NULL THEN 1 ELSE 0 END) AS RM,
        SUM(CASE WHEN "AGE" IS NULL THEN 1 ELSE 0 END) AS AGE,
        SUM(CASE WHEN "DIS" IS NULL THEN 1 ELSE 0 END) AS DIS,
        SUM(CASE WHEN "RAD" IS NULL THEN 1 ELSE 0 END) AS RAD,
        SUM(CASE WHEN "TAX" IS NULL THEN 1 ELSE 0 END) AS TAX,
        SUM(CASE WHEN "PTRATIO" IS NULL THEN 1 ELSE 0 END) AS PTRATIO,
        SUM(CASE WHEN "LSTAT" IS NULL THEN 1 ELSE 0 END) AS LSTAT,
        SUM(CASE WHEN "MEDV" IS NULL THEN 1 ELSE 0 END) AS MEDV
    FROM postgres.public.table_name
    """,
    con,
)

   crim  zn  indus  chas  nox  rm  age  dis  rad  tax  ptratio  lstat  medv
0     0   0      0     0    0   0    0    0    0    0        0      0     0

**2 способ**

In [8]:
cols = pd.read_sql("""SELECT * FROM postgres.public.table_name limit 1""", con).columns
cols = map(lambda x: '"'+x+'"', cols)
pd.read_sql(""f"SELECT {', '.join([f'SUM(CASE WHEN {col} IS NULL THEN 1 ELSE 0 END) AS {col}' for col in cols])} FROM postgres.public.table_name""", con)

   CRIM  ZN  INDUS  CHAS  NOX  RM  AGE  DIS  RAD  TAX  PTRATIO  B  LSTAT  MEDV
0     0   0      0     0    0   0    0    0    0    0        0  0      0     0

**Проверка**

In [9]:
pd.read_sql("""SELECT * FROM postgres.public.table_name""", con).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CRIM     506 non-null    float64
 1   ZN       506 non-null    float64
 2   INDUS    506 non-null    float64
 3   CHAS     506 non-null    float64
 4   NOX      506 non-null    float64
 5   RM       506 non-null    float64
 6   AGE      506 non-null    float64
 7   DIS      506 non-null    float64
 8   RAD      506 non-null    float64
 9   TAX      506 non-null    float64
 10  PTRATIO  506 non-null    float64
 11  B        506 non-null    float64
 12  LSTAT    506 non-null    float64
 13  MEDV     506 non-null    float64
dtypes: float64(14)
memory usage: 55.5 KB

**Вывод**

Пропусков в данных не обнаружено

2. Выведите количество уникальных значений по каждой из колонок (название колонки, кол-во уникальных значений)

In [10]:
cols = pd.read_sql("""SELECT * FROM postgres.public.table_name limit 1""", con).columns
cols = map(lambda x: '"'+x+'"', cols)
pd.read_sql(""f"SELECT {', '.join([f'COUNT(DISTINCT {col}) AS {col}' for col in cols])} FROM postgres.public.table_name""", con)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,504,26,76,2,81,446,356,412,9,66,46,357,455,229

Проверка

In [11]:
data = pd.read_sql("""SELECT * FROM postgres.public.table_name""", con)
pd.DataFrame({col:[len(data[col].unique())]for col in data.columns}).T.rename(columns={0: "unique_value_count"})

         unique_value_count
CRIM                    504
ZN                       26
INDUS                    76
CHAS                      2
NOX                      81
RM                      446
AGE                     356
DIS                     412
RAD                       9
TAX                      66
PTRATIO                  46
B                       357
LSTAT                   455
MEDV                    229

**Вывод**

Признаки CRIM, RM, AGE, DIS, B, LSTAT, MEDV можно считать за непрерывные величины, так как количество уникальных значений соразмерно размеру датасета
Признаки CHAS и RAD можно считать категориальными

3. Выведите колонки, у которых медиана равна минимальному значению (название колонки).
Напишите какой вывод можно сделать по данным в этих колонках

In [12]:
pd.read_sql(
    """
with table1 as (SELECT 'CRIM' AS name,  percentile_cont(0.5) WITHIN GROUP (ORDER BY "CRIM") AS median, MIN("CRIM") FROM postgres.public.table_name
union
SELECT 'ZN' AS name,  percentile_cont(0.5) WITHIN GROUP (ORDER BY "ZN") AS median, MIN("ZN") FROM postgres.public.table_name
union
SELECT 'INDUS' AS name,  percentile_cont(0.5) WITHIN GROUP (ORDER BY "INDUS") AS median, MIN("INDUS") FROM postgres.public.table_name
union
SELECT 'CHAS' AS name,  percentile_cont(0.5) WITHIN GROUP (ORDER BY "CHAS") AS median, MIN("CHAS") FROM postgres.public.table_name
union
SELECT 'NOX' AS name,  percentile_cont(0.5) WITHIN GROUP (ORDER BY "NOX") AS median, MIN("NOX") FROM postgres.public.table_name
union
SELECT 'RM' AS name,  percentile_cont(0.5) WITHIN GROUP (ORDER BY "RM") AS median, MIN("RM") FROM postgres.public.table_name
union
SELECT 'AGE' AS name,  percentile_cont(0.5) WITHIN GROUP (ORDER BY "AGE") AS median, MIN("AGE") FROM postgres.public.table_name
union
SELECT 'DIS' AS name,  percentile_cont(0.5) WITHIN GROUP (ORDER BY "DIS") AS median, MIN("DIS") FROM postgres.public.table_name
union
SELECT 'RAD' AS name,  percentile_cont(0.5) WITHIN GROUP (ORDER BY "RAD") AS median, MIN("RAD") FROM postgres.public.table_name
union
SELECT 'TAX' AS name,  percentile_cont(0.5) WITHIN GROUP (ORDER BY "TAX") AS median, MIN("TAX") FROM postgres.public.table_name
union
SELECT 'PTRATIO' AS name,  percentile_cont(0.5) WITHIN GROUP (ORDER BY "PTRATIO") AS median, MIN("PTRATIO") FROM postgres.public.table_name
union
SELECT 'B' AS name,  percentile_cont(0.5) WITHIN GROUP (ORDER BY "B") AS median, MIN("B") FROM postgres.public.table_name
union
SELECT 'LSTAT' AS name,  percentile_cont(0.5) WITHIN GROUP (ORDER BY "LSTAT") AS median, MIN("LSTAT") FROM postgres.public.table_name
union
SELECT 'MEDV' AS name,  percentile_cont(0.5) WITHIN GROUP (ORDER BY "MEDV") AS median, MIN("MEDV") FROM postgres.public.table_name
)
SELECT name from table1 where median = min
    """,
    con,
)

   name
0    ZN
1  CHAS

**Проверка**

In [13]:
data = pd.read_sql("""SELECT * FROM postgres.public.table_name""", con).describe().T
list(data[data['50%'] == data['min']].index)

['ZN', 'CHAS']

**Вывод**
Полученные признаки имеют небольшое количество уникальных значений, т.е. их можно считать категориальными.
Таким образом, большая часть объектов имеет значения этих признаков равных их минимальным величинам.
То есть большая часть объектов не граничит с рекой и они находятся в районе, где земли не зонированы под жилую застройку участками площадью более 25 000 кв. футов

4. Выведите разницу между средним количеством комнат (RM) в домах с самой дорогой стоимостью(MEDV) и 25 самыми дешевыми домами.
Аналогично по 50, 100, 200, 300 самыми дешевыми домами. (кол-во домов(25,50,100,200,300), среднее кол-во комнат в них, среднее кол-во комнат в самых дорогих, разница).
Напишите влияет ли кол-во комнат на стоимость и как сильно.

In [77]:
pd.read_sql(
    """
    with table6 as (SELECT "RM", "MEDV", MAX("MEDV") OVER() AS "MAX MEDV"
    FROM postgres.public.table_name)
    SELECT  "MEDV","RM",
    "RM" - (with table1 AS (SELECT "RM", "MEDV", row_number() OVER (ORDER BY "MEDV") rank_by_medv FROM postgres.public.table_name) SELECT AVG("RM") FROM table1 WHERE rank_by_medv <= 25) AS "RM diff 25",
    "RM" - (with table2 AS (SELECT "RM", "MEDV", row_number() OVER (ORDER BY "MEDV") rank_by_medv FROM postgres.public.table_name) SELECT AVG("RM") FROM table2 WHERE rank_by_medv <= 50) AS "RM diff 50",
    "RM" - (with table3 AS (SELECT "RM", "MEDV", row_number() OVER (ORDER BY "MEDV") rank_by_medv FROM postgres.public.table_name) SELECT AVG("RM") FROM table3 WHERE rank_by_medv <= 100) AS "RM diff 100",
    "RM" - (with table4 AS (SELECT "RM", "MEDV", row_number() OVER (ORDER BY "MEDV") rank_by_medv FROM postgres.public.table_name) SELECT AVG("RM") FROM table4 WHERE rank_by_medv <= 200) AS "RM diff 200",
    "RM" - (with table5 AS (SELECT "RM", "MEDV", row_number() OVER (ORDER BY "MEDV") rank_by_medv FROM postgres.public.table_name) SELECT AVG("RM") FROM table5 WHERE rank_by_medv <= 300) AS "RM diff 300"
    FROM table6 WHERE "MEDV" = "MAX MEDV"
    """,
    con
)

    MEDV     RM  RM diff 25  RM diff 50  RM diff 100  RM diff 200  RM diff 300
0   50.0  7.489      1.7566     1.73398      1.60876     1.577295     1.516773
1   50.0  7.802      2.0696     2.04698      1.92176     1.890295     1.829773
2   50.0  8.375      2.6426     2.61998      2.49476     2.463295     2.402773
3   50.0  7.929      2.1966     2.17398      2.04876     2.017295     1.956773
4   50.0  7.831      2.0986     2.07598      1.95076     1.919295     1.858773
5   50.0  7.875      2.1426     2.11998      1.99476     1.963295     1.902773
6   50.0  8.034      2.3016     2.27898      2.15376     2.122295     2.061773
7   50.0  8.725      2.9926     2.96998      2.84476     2.813295     2.752773
8   50.0  8.704      2.9716     2.94898      2.82376     2.792295     2.731773
9   50.0  8.297      2.5646     2.54198      2.41676     2.385295     2.324773
10  50.0  7.923      2.1906     2.16798      2.04276     2.011295     1.950773
11  50.0  4.970     -0.7624    -0.78502     -0.91024    -0.941705    -1.002227
12  50.0  6.683      0.9506     0.92798      0.80276     0.771295     0.710773
13  50.0  7.016      1.2836     1.26098      1.13576     1.104295     1.043773
14  50.0  6.216      0.4836     0.46098      0.33576     0.304295     0.243773
15  50.0  5.875      0.1426     0.11998     -0.00524    -0.036705    -0.097227

**Вывод**

Полученные результаты не позволяют сделать однозначный вывод о влиянии количества комнат на стоимость.

Однако расчеты показали, что в самых дорогих домах в большинстве случаев на 2 комнаты больше.

5. Выведите ранги значений колонки LSTAT(процент населения с более низким статусом) в домах с самой дорогой стоимостью (значение LSTAT, стоимость, ранг). Напишите какой вывод можно сделать по этим данным.

In [84]:
pd.read_sql(
    """
    with table1 as (SELECT "LSTAT", "MEDV", MAX("MEDV") OVER() AS "MAX MEDV"
    FROM postgres.public.table_name)
    SELECT  "MEDV", "LSTAT", RANK() OVER(ORDER BY "LSTAT" DESC)
    FROM table1
    WHERE"MEDV" = "MAX MEDV"
    """,
    con,
)

    MEDV  LSTAT  rank
0   50.0   9.53     1
1   50.0   8.88     2
2   50.0   7.44     3
3   50.0   5.12     4
4   50.0   4.63     5
5   50.0   4.45     6
6   50.0   3.73     7
7   50.0   3.70     8
8   50.0   3.32     9
9   50.0   3.26    10
10  50.0   3.16    11
11  50.0   2.97    12
12  50.0   2.96    13
13  50.0   2.88    14
14  50.0   1.92    15
15  50.0   1.73    16

**Вывод**

В домах с высокой стоимостью процент населения с более низким статусом не превышает 10%. Таким образом, можно предположить, что в таких домах живут люди с равновысоким статусом.

6. Выведите среднюю стоимость домов граничащих с рекой(CHAS) и нет (граничит/не граничит, стоимость)

In [90]:
pd.read_sql(
    """
    SELECT "CHAS", AVG("MEDV") as "AVG MEDV"
    FROM postgres.public.table_name
    GROUP BY "CHAS"
    """,
    con,
)

   CHAS   AVG MEDV
0   0.0  22.093843
1   1.0  28.440000

**Вывод**

Средняя стоимость домов у реки выше. Вероятно, это связано с более высокой стоимостью "видовых" квартир.

7. Выведите все колонки, у которых среднее значение выше, когда дом граничит с рекой (название колонки). Напишите какой вывод можно сделать по этим данным.

In [113]:
pd.read_sql(
    """
    SELECT
    AVG("CRIM") as "AVG CRIM",
    AVG("ZN") as "AVG ZN",
    AVG("INDUS") as "AVG INDUS",
    AVG("NOX") as "AVG NOX",
    AVG("RM") as "AVG RM",
    AVG("AGE") as "AVG AGE",
    AVG("DIS") as "AVG DIS",
    AVG("RAD") as "AVG RAD",
    AVG("TAX") as "AVG TAX",
    AVG("PTRATIO") as "AVG PTRATIO",
    AVG("B") as "AVG B",
    AVG("LSTAT") as "AVG LSTAT",
    AVG("MEDV") as "AVG MEDV"
    FROM postgres.public.table_name
    GROUP BY "CHAS"
     """,
    con,
).T.rename(columns={0: 'no_river', 1:'near_river'}).query('near_river > no_river')

             no_river  near_river
AVG INDUS   11.019193   12.719143
AVG NOX      0.551817    0.593426
AVG RM       6.267174    6.519600
AVG AGE     67.911677   77.500000
AVG B      355.461040  372.997429
AVG MEDV    22.093843   28.440000

**Вывод**

Дома у реки в среднем построены раньше, что логично, так как развитие городов начинается у водоемов.

Большая величина среднего количества комнат в домах у реки может косвенно свидетельствовать о более высокой плотности населения.

Для развития города необходима промышленность, следовательно доля негоргового бизнеса у реки выше по той же логике, что и возраст зданий.

Если рассматривать концентрацию оксидов азота как вредные выбросы от промышленных предприятий, то становится логичной их большая концентрация там где больше доля неторгового бизнеса.

В современных условиях более высокая стоимость жилья у реки вероятнее всего обусловлена видом из окон квартир.

8. Выведите значения долей промышленной застройки(INDUS), концентрации оксидов азота(NOX) и по их перцентилям - 10, 20 ... 100 ( перцетиль(10,20...100),значение INDUS, значение NOX). Напишите прослеживается между ними взаимосвязь

In [126]:
pd.read_sql(
    """
    SELECT 10 AS percentile,
    percentile_cont(0.1) WITHIN GROUP (ORDER BY "INDUS") AS "INDUS",
    percentile_cont(0.1) WITHIN GROUP (ORDER BY "NOX") AS "NOX"
    FROM postgres.public.table_name
    union
    SELECT 20 AS percentile,
    percentile_cont(0.2) WITHIN GROUP (ORDER BY "INDUS") AS "INDUS",
    percentile_cont(0.2) WITHIN GROUP (ORDER BY "NOX") AS "NOX"
    FROM postgres.public.table_name
    union
    SELECT 30 AS percentile,
    percentile_cont(0.3) WITHIN GROUP (ORDER BY "INDUS") AS "INDUS",
    percentile_cont(0.3) WITHIN GROUP (ORDER BY "NOX") AS "NOX"
    FROM postgres.public.table_name
    union
    SELECT 40 AS percentile,
    percentile_cont(0.4) WITHIN GROUP (ORDER BY "INDUS") AS "INDUS",
    percentile_cont(0.4) WITHIN GROUP (ORDER BY "NOX") AS "NOX"
    FROM postgres.public.table_name
    union
    SELECT 50 AS percentile,
    percentile_cont(0.5) WITHIN GROUP (ORDER BY "INDUS") AS "INDUS",
    percentile_cont(0.5) WITHIN GROUP (ORDER BY "NOX") AS "NOX"
    FROM postgres.public.table_name
    union
    SELECT 60 AS percentile,
    percentile_cont(0.6) WITHIN GROUP (ORDER BY "INDUS") AS "INDUS",
    percentile_cont(0.6) WITHIN GROUP (ORDER BY "NOX") AS "NOX"
    FROM postgres.public.table_name
    union
    SELECT 70 AS percentile,
    percentile_cont(0.7) WITHIN GROUP (ORDER BY "INDUS") AS "INDUS",
    percentile_cont(0.7) WITHIN GROUP (ORDER BY "NOX") AS "NOX"
    FROM postgres.public.table_name
    union
    SELECT 80 AS percentile,
    percentile_cont(0.8) WITHIN GROUP (ORDER BY "INDUS") AS "INDUS",
    percentile_cont(0.8) WITHIN GROUP (ORDER BY "NOX") AS "NOX"
    FROM postgres.public.table_name
    union
    SELECT 90 AS percentile,
    percentile_cont(0.9) WITHIN GROUP (ORDER BY "INDUS") AS "INDUS",
    percentile_cont(0.9) WITHIN GROUP (ORDER BY "NOX") AS "NOX"
    FROM postgres.public.table_name
    union
    SELECT 100 AS percentile,
    percentile_cont(1) WITHIN GROUP (ORDER BY "INDUS") AS "INDUS",
    percentile_cont(1) WITHIN GROUP (ORDER BY "NOX") AS "NOX"
    FROM postgres.public.table_name
    order by percentile
    """,
    con,
)

   percentile  INDUS    NOX
0          10   2.91  0.427
1          20   4.39  0.442
2          30   5.96  0.472
3          40   7.38  0.507
4          50   9.69  0.538
5          60  12.83  0.575
6          70  18.10  0.605
7          80  18.10  0.668
8          90  19.58  0.713
9         100  27.74  0.871

**Вывод**

С ростом доли неторгового бизнеса (промышленности) возрастает и концентрация оксидов азота.

CRIM - уровень преступности на душу населения
ZN - доля земель под жилую застройку зонирована под участки площадью более 25 000 кв. футов.
INDUS - доля акров неторгового бизнеса на город.
CHAS - 1, если граничит с рекой, 0 иначе
NOX - концентрация оксидов азота (частей на 10 миллионов)
RM - среднее количество комнат в квартире
AGE - доля жилых домов, построенных до 1940 г.
DIS - взвешенные расстояния до пяти центров занятости Бостона
RAD - индекс доступности к радиальным магистралям
TAX - полная ставка налога на имущество за 10 000 долларов США
PTRATIO - соотношение учеников и учителей по городам
B - 1000(Bk - 0.63)^2, где Bk доля чернокожих людей по городам
LSTAT - % более низкого статуса населения
MEDV - Средняя стоимость домов в 1000 долларов.